Documents/упЭтапПодбораПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЭтапПодбораПеревозчика</Name>
			<Comment>{служебный документ}</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершенУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тендер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСхемыВыбораПеревозчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упЭтапыСхемыВыбораПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаявкаНаТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упПеревозчикПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПеревозчикПоРейсу</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПлановыеПараметрыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПлановыеПараметрыРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтдыхаВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемоеКоличествоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеНачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполненияИсходное</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнкассации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСтатусыЗаявкиНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыЗаявкиНаТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упЭтапыСхемыВыбораПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упЭтапыСхемыВыбораПеревозчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаТекущемуПеревозчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределениеПоДействующимСоглашениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборПеревозчикаБезСоглашения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСоглашенияСПеревозчиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСоглашенияСПеревозчиками</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.упПартнеры</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.упДоговорыКонтрагентов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаТарифов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозкаТранспортнойКомпанией</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыСоглашений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнятьПоЗаданиям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/упЭтапПодбораПеревозчика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Свойство("Ссылка") Тогда
		СтандартнаяОбработка = Ложь;
		
		сткРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные.Ссылка, "НомерЭтапа, ЭтапСхемыВыбораПеревозчика");
		Представление = НСтр(СтрШаблон("ru = 'Этап %1. %2'", Строка(сткРеквизиты.НомерЭтапа), сткРеквизиты.ЭтапСхемыВыбораПеревозчика));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 	
	
#Область ПрограммныйИнтерфейс  

// Процедура изменения статуса документа.
//
// Параметры:
//  Рейс  - ДокументСсылка - ссылка на документ.
//  ТекущийЭтап  - СправочникСсылка - Ссылка на объект.
//  СписокПеревозчиков  - СписоЗначений - Список ссылок.
//  ТекстОшибки  - Строка - Пердставление ошибки.
//  Отказ  - Булево - Выполнить отказ.
//
Процедура ПерейтиКСледующемуЭтапу(Рейс, ТекущийЭтап, СписокПеревозчиков = Неопределено, ТекстОшибки, Отказ) Экспорт
	
	Если ЗначениеЗаполнено(ТекущийЭтап) Тогда
		
		НачатьТранзакцию();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("Документ.упЭтапПодбораПеревозчика");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
		
		Попытка
			БлокировкаДанных.Заблокировать();
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ТекущийЭтап,,, Отказ);
			ЗаписьЖурналаРегистрации("ОшибкаБлокировки", УровеньЖурналаРегистрации.Ошибка,, ТекущийЭтап, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;
		
		ЭтапОбъект = ТекущийЭтап.ПолучитьОбъект();
		Если ЭтапОбъект.Завершен Или ЭтапОбъект.ЗавершенУспешно Тогда
			ТекстОшибки = НСтр(СтрШаблон("ru = '""%1"" завершен. Дальнейшие действия над этапом запрещены'", ТекущийЭтап));
			Отказ = Истина;
		КонецЕсли; 
		
		Если Не Отказ Тогда
			Для каждого текСтрока Из ЭтапОбъект.Заявки Цикл
				ЗаявкаОбъект = текСтрока.ЗаявкаНаТС.ПолучитьОбъект();
				ЗаявкаОбъект.ДополнительныеСвойства.Вставить("Статус", Перечисления.упСтатусыЗаявкиНаТС.Отклонена);
				
				Попытка
					ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Отказ = Истина;                                                                                                                                                                                                                                                                                                                                                                                                                                                 
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
						ТекстОшибки = ОписаниеОшибки();
					КонецЕсли;
					ЗаписьЖурналаРегистрации("Запись", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.упЗаявкаНаТС,, ТекстОшибки);
					Прервать;
				КонецПопытки;
			КонецЦикла;
		КонецЕсли; 
				
		ЭтапОбъект.Отклонен = Истина;
		ЭтапОбъект.Записать();

		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		Иначе
			ЗафиксироватьТранзакцию();
		КонецЕсли; 
		
		Результат = Документы.упРейс.СформироватьЗаявкуНаТСПоРейсу(Рейс,, СписокПеревозчиков, ТекстОшибки, Отказ);
		
	Иначе
		Результат = Документы.упРейс.СформироватьЗаявкуНаТСПоРейсу(Рейс,, СписокПеревозчиков, ТекстОшибки, Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры

// Возвращает результат формирования заявки.
//
// Параметры:
//  Рейс  - ДокументСсылка - ссылка на документ.
//  ТекущаяИтерация  - СправочникСсылка - Ссылка на объект.
//  СписокПеревозчиков  - СписоЗначений - Список ссылок.
//  ТекстОшибки  - Строка - Пердставление ошибки.
//  Отказ  - Булево - Выполнить отказ.
//
// Возвращаемое значение:
//     ДокументСсылка - Ссылка на документ.
//
Функция ПерейтиКСледующейИтерации(Рейс, ТекущаяИтерация, СписокПеревозчиков = Неопределено, ТекстОшибки, Отказ) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ТекущаяИтерация) Тогда
		ЗаявкаОбъект = ТекущаяИтерация.ПолучитьОбъект();
		ЗаявкаОбъект.ДополнительныеСвойства.Вставить("Статус", Перечисления.упСтатусыЗаявкиНаТС.Отклонена);
		
		Попытка
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Отказ = Истина;                                                                                                                                                                                                                                                                                                                                                                                                                                                 
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ЗаписьЖурналаРегистрации("Запись", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.упЗаявкаНаТС,, ТекстОшибки);
		КонецПопытки;
		
		Если Не Отказ Тогда
			Результат = Документы.упРейс.СформироватьЗаявкуНаТСПоРейсу(Рейс,, СписокПеревозчиков, ТекстОшибки, Отказ);
		КонецЕсли; 
		
	Иначе
		Результат = Документы.упРейс.СформироватьЗаявкуНаТСПоРейсу(Рейс,, СписокПеревозчиков, ТекстОшибки, Отказ);
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает таблицу доступных перевозчиков.
//
// Параметры:
//  Рейс  - ДокументСсылка - ссылка на документ.
//  ЭтапСхемы  - СправочникСсылка - Ссылка на объект.
//  ЭтоТендер  - Булево - флаг.
//  СписокПеревозчиков  - СписоЗначений - Список ссылок.
//  ВидТранспорта  - ПеречислениеСсылка.упВидыТранспорта - вид.
//
// Возвращаемое значение:
//     ТаблицаЗначений - Данные обработки.
//
Функция ПодобратьПеревозчиков(Рейс, ЭтапСхемы, ЭтоТендер, СписокПеревозчиков = Неопределено, ВидТранспорта = Неопределено) Экспорт
	
	тзПеревозчики = Новый ТаблицаЗначений;
	тзПеревозчики.Колонки.Добавить("Перевозчик", Новый ОписаниеТипов("СправочникСсылка.упПартнеры"));
	тзПеревозчики.Колонки.Добавить("Соглашение", Новый ОписаниеТипов("СправочникСсылка.упСоглашенияСПеревозчиками"));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	упЭтапПодбораПеревозчикаЗаявки.ЗаявкаНаТС
	|ПОМЕСТИТЬ втЗаявки
	|ИЗ
	|	Документ.упЭтапПодбораПеревозчика.Заявки КАК упЭтапПодбораПеревозчикаЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЭтапПодбораПеревозчика КАК упЭтапПодбораПеревозчика
	|		ПО упЭтапПодбораПеревозчикаЗаявки.Ссылка = упЭтапПодбораПеревозчика.Ссылка
	|			И (упЭтапПодбораПеревозчика.Рейс = &Рейс)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упЗаявкаНаТС.Перевозчик
	|ПОМЕСТИТЬ втПеревозчикиИсключить
	|ИЗ
	|	Документ.упЗаявкаНаТС КАК упЗаявкаНаТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗаявки КАК втЗаявки
	|		ПО упЗаявкаНаТС.Ссылка = втЗаявки.ЗаявкаНаТС
	|;";
	
	Если ЭтапСхемы = Перечисления.упЭтапыСхемыВыбораПеревозчика.ЗаявкаТекущемуПеревозчику Тогда
		ДополнитьЗапросЗаявкаТекущемуПеревозчику(ТекстЗапроса);
	ИначеЕсли ЭтапСхемы = Перечисления.упЭтапыСхемыВыбораПеревозчика.ОпределениеПоДействующимСоглашениям Тогда	
		ДополнитьЗапросОпределениеПоДействующимСоглашениям(ТекстЗапроса);
	ИначеЕсли ЭтапСхемы = Перечисления.упЭтапыСхемыВыбораПеревозчика.ВыборПеревозчикаБезСоглашения Тогда	
		ДополнитьЗапросВыборПеревозчикаБезСоглашения(ТекстЗапроса);
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Если СписокПеревозчиков = Неопределено И Не ЗначениеЗаполнено(ВидТранспорта) Тогда
		Запрос.Текст = ТекстЗапроса;
		
	Иначе
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		Если СписокПеревозчиков <> Неопределено Тогда
			Запрос.УстановитьПараметр("СписокПеревозчиков", СписокПеревозчиков);
			СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1].Операторы[0].Отбор.Добавить("Перевозчик В (&СписокПеревозчиков)");
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ВидТранспорта) Тогда
			Запрос.УстановитьПараметр("ВидТранспорта", ВидТранспорта);
			СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1].Операторы[0].Отбор.Добавить("Перевозчик.ВидТранспорта В (&ВидТранспорта, ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ПустаяСсылка))");
		КонецЕсли; 
			
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если ЭтоТендер Тогда
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(тзПеревозчики.Добавить(), Выборка);
			КонецЦикла; 
		Иначе
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(тзПеревозчики.Добавить(), Выборка);
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат тзПеревозчики;

КонецФункции // ПодобратьПеревозчиков()

// Возвращает ссылку на текущий этап.
//
// Параметры:
//  Рейс  - ДокументСсылка - ссылка на документ.
//
// Возвращаемое значение:
//     ДокументСсылка - Этап.
//
Функция ПолучитьТекущийЭтап(Рейс) Экспорт
	
	ТекущийЭтап = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	упЭтапПодбораПеревозчика.Ссылка
	|ИЗ
	|	Документ.упЭтапПодбораПеревозчика КАК упЭтапПодбораПеревозчика
	|ГДЕ
	|	упЭтапПодбораПеревозчика.Рейс = &Рейс
	|	И НЕ упЭтапПодбораПеревозчика.Отклонен
	|	И НЕ упЭтапПодбораПеревозчика.ЗавершенУспешно
	|	И НЕ упЭтапПодбораПеревозчика.Завершен
	|
	|УПОРЯДОЧИТЬ ПО
	|	упЭтапПодбораПеревозчика.НомерЭтапа УБЫВ";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ТекущийЭтап = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат ТекущийЭтап;
	
КонецФункции // ПолучитьТекущийЭтап()

// Возвращает ссылку на текущую заявку на ТС.
//
// Параметры:
//  Рейс  - ДокументСсылка - ссылка на документ.
//
// Возвращаемое значение:
//     ДокументСсылка - Итерация.
//
Функция ПолучитьТекущуюИтерацию(Рейс) Экспорт
		
	ТекущаяИтерация = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упЭтапПодбораПеревозчика.Ссылка КАК Этап,
	|	упЭтапПодбораПеревозчика.НомерЭтапа
	|ПОМЕСТИТЬ втЭтапы
	|ИЗ
	|	Документ.упЭтапПодбораПеревозчика КАК упЭтапПодбораПеревозчика
	|ГДЕ
	|	упЭтапПодбораПеревозчика.Рейс = &Рейс
	|	И НЕ упЭтапПодбораПеревозчика.Отклонен
	|	И НЕ упЭтапПодбораПеревозчика.ЗавершенУспешно
	|	И НЕ упЭтапПодбораПеревозчика.Завершен
	|	И НЕ упЭтапПодбораПеревозчика.Тендер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЭтапы.Этап
	|ПОМЕСТИТЬ втТекущийЭтап
	|ИЗ
	|	втЭтапы КАК втЭтапы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(втЭтапы.НомерЭтапа) КАК НомерЭтапа
	|		ИЗ
	|			втЭтапы КАК втЭтапы) КАК ВложенныйЗапрос
	|		ПО втЭтапы.НомерЭтапа = ВложенныйЗапрос.НомерЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упЗаявки.НомерСтроки,
	|	упЗаявки.ЗаявкаНаТС
	|ПОМЕСТИТЬ втЗаявкиПоЭтапу
	|ИЗ
	|	втТекущийЭтап КАК втТекущийЭтап
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЭтапПодбораПеревозчика.Заявки КАК упЗаявки
	|		ПО втТекущийЭтап.Этап = упЗаявки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаявкиПоЭтапу.ЗаявкаНаТС
	|ИЗ
	|	втЗаявкиПоЭтапу КАК втЗаявкиПоЭтапу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(втЗаявкиПоЭтапу.НомерСтроки) КАК НомерСтроки
	|		ИЗ
	|			втЗаявкиПоЭтапу КАК втЗаявкиПоЭтапу) КАК ВложенныйЗапрос
	|		ПО втЗаявкиПоЭтапу.НомерСтроки = ВложенныйЗапрос.НомерСтроки";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ТекущаяИтерация = Выборка.ЗаявкаНаТС;
	КонецЕсли; 
	
	Возврат ТекущаяИтерация;
	 
КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьЗапросЗаявкаТекущемуПеревозчику(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	упПеревозчикПоРейсуСрезПоследних.Перевозчик,
	|	упПеревозчикПоРейсуСрезПоследних.Соглашение
	|ИЗ
	|	РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(, Рейс = &Рейс) КАК упПеревозчикПоРейсуСрезПоследних
	|ГДЕ
	|	НЕ упПеревозчикПоРейсуСрезПоследних.Перевозчик В
	|				(ВЫБРАТЬ
	|					втПеревозчикиИсключить.Перевозчик
	|				ИЗ
	|					втПеревозчикиИсключить)
	|	И упПеревозчикПоРейсуСрезПоследних.Перевозчик <> ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)
	|	И упПеревозчикПоРейсуСрезПоследних.Соглашение <> ЗНАЧЕНИЕ(Справочник.упСоглашениясПеревозчиками.ПустаяСсылка)";
	
КонецПроцедуры

Процедура ДополнитьЗапросОпределениеПоДействующимСоглашениям(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	упПартнеры.Ссылка КАК Перевозчик
	|ПОМЕСТИТЬ втПеревозчикиПодготовка
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|ГДЕ
	|	НЕ упПартнеры.ПометкаУдаления
	|	И упПартнеры.Перевозчик
	|	И НЕ упПартнеры.Ссылка В
	|				(ВЫБРАТЬ
	|					втПеревозчикиИсключить.Перевозчик
	|				ИЗ
	|					втПеревозчикиИсключить)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения
	|ПОМЕСТИТЬ втПараметрыРейса
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	|		ПО (упРейс.Ссылка = &Рейс)
	|			И упРейс.Ссылка = упПлановыеПараметрыРейса.Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПеревозчики.Перевозчик,
	|	упСоглашенияСПеревозчиками.Ссылка КАК Соглашение,
	|	упСоглашенияСПеревозчиками.ДатаНачалаДействия,
	|	ВЫБОР
	|		КОГДА упСоглашенияСПеревозчиками.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
	|		ИНАЧЕ упСоглашенияСПеревозчиками.ДатаОкончанияДействия
	|	КОНЕЦ КАК ДатаОкончанияДействия
	|ПОМЕСТИТЬ втСоглашения
	|ИЗ
	|	втПеревозчикиПодготовка КАК втПеревозчики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упСоглашенияСПеревозчиками КАК упСоглашенияСПеревозчиками
	|		ПО втПеревозчики.Перевозчик = упСоглашенияСПеревозчиками.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСоглашения.Перевозчик,
	|	МАКСИМУМ(втСоглашения.Соглашение) КАК Соглашение
	|ИЗ
	|	втСоглашения КАК втСоглашения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыРейса КАК втПараметрыРейса
	|		ПО (втПараметрыРейса.ПлановоеНачалоВыполнения МЕЖДУ втСоглашения.ДатаНачалаДействия И втСоглашения.ДатаОкончанияДействия)
	|
	|СГРУППИРОВАТЬ ПО
	|	втСоглашения.Перевозчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	втСоглашения.Перевозчик";
	
	// дополнить сортировку по тарифам
	
КонецПроцедуры

Процедура ДополнитьЗапросВыборПеревозчикаБезСоглашения(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	упПартнеры.Ссылка КАК Перевозчик
	|ПОМЕСТИТЬ втПеревозчикиПодготовка
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|ГДЕ
	|	НЕ упПартнеры.ПометкаУдаления
	|	И упПартнеры.Перевозчик
	|	И НЕ упПартнеры.Ссылка В
	|				(ВЫБРАТЬ
	|					втПеревозчикиИсключить.Перевозчик
	|				ИЗ
	|					втПеревозчикиИсключить)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения
	|ПОМЕСТИТЬ втПараметрыРейса
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	|		ПО (упРейс.Ссылка = &Рейс)
	|			И упРейс.Ссылка = упПлановыеПараметрыРейса.Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПеревозчики.Перевозчик,
	|	упСоглашенияСПеревозчиками.Ссылка КАК Соглашение,
	|	упСоглашенияСПеревозчиками.ДатаНачалаДействия,
	|	ВЫБОР
	|		КОГДА упСоглашенияСПеревозчиками.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
	|		ИНАЧЕ упСоглашенияСПеревозчиками.ДатаОкончанияДействия
	|	КОНЕЦ КАК ДатаОкончанияДействия
	|ПОМЕСТИТЬ втСоглашения
	|ИЗ
	|	втПеревозчикиПодготовка КАК втПеревозчики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упСоглашенияСПеревозчиками КАК упСоглашенияСПеревозчиками
	|		ПО втПеревозчики.Перевозчик = упСоглашенияСПеревозчиками.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСоглашения.Перевозчик
	|ПОМЕСТИТЬ втИсключитьДополнительно
	|ИЗ
	|	втСоглашения КАК втСоглашения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыРейса КАК втПараметрыРейса
	|		ПО (втПараметрыРейса.ПлановоеНачалоВыполнения МЕЖДУ втСоглашения.ДатаНачалаДействия И втСоглашения.ДатаОкончанияДействия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПеревозчики.Перевозчик
	|ИЗ
	|	втПеревозчикиПодготовка КАК втПеревозчики
	|ГДЕ
	|	НЕ втПеревозчики.Перевозчик В
	|				(ВЫБРАТЬ
	|					втИсключитьДополнительно.Перевозчик
	|				ИЗ
	|					втИсключитьДополнительно)
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПеревозчики.Перевозчик";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
